package Y1概述;

//数据结构的常用数据结构有：栈，数组，队列，链表，红黑树
    /*
    栈(stack又称堆栈):它是运算受限的运算表，其限制是仅允许在标的一端进行插入和删除操作，不允许在其他任何位置进行添加、查找、删除登操作
                特点:
                    1.先进后出（弹夹）
                    2.栈的出入口都是栈的顶端位置
     */

    /*
    队列(queue，简称队):他跟堆栈一样，也是运算受限的运算表，其限制是仅允许在表的一端进行插入，而在表的另一端删除
                特点:
                    1.先进先出（火车过山洞）
                    2.队列的入口、出口各占一侧
     */

    /*
    数组(Array):是有序的元素序列，数组是在内存中开辟一段连续的空间并再次空间存放元素
                特点:
                    1.查询块
                    2.增删慢：每当更改内容，就会创建一个新的数组，把原数组改后的值赋予新数组
     */

    /*
    链表(LinkedList):由一系列结点node(链表中的每一个元素称为结点)组成，结点可以在运行时动态生成。
                    [每个结点包括两个部分:1.存储数据元素的数据域2.存储下一个结点地址的指针域]
                特点:
                    1.多个结点之间，通过地址进行链接（手拉手）
                    2.查询慢（链表中地址不是连续的，每次查询需要从头开始）
                    3.增删块
     */

    /*
    红黑树:趋近于平衡树（左右相等，分支不超过2）查询叶子结点的最大次数和最小次数不超过两倍

                特点:
                    1.查询速度非常块

     */
public class Test {
}
